Revit 2027 API
AssemblyInstance.IsValidNamingCategory Method
 Identifies if the naming category is valid for an assembly instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidNamingCategory(
	Document document,
	ElementId namingCategoryId,
	ICollection<ElementId> assemblyMemberIds
)
Public Shared Function IsValidNamingCategory (
	document As Document,
	namingCategoryId As ElementId,
	assemblyMemberIds As ICollection(Of ElementId)
) As Boolean
public:
static bool IsValidNamingCategory(
	Document^ document,
	ElementId^ namingCategoryId,
	ICollection<ElementId^>^ assemblyMemberIds
)
static member IsValidNamingCategory :
        document : Document *
        namingCategoryId : ElementId *
        assemblyMemberIds : ICollection<ElementId> -> bool
Parameters
document Document
 The document for the assembly instance.
namingCategoryId ElementId
 The id of the naming category for the assembly instance.
assemblyMemberIds ICollection<ElementId>
 Member ids to check validity of naming category
Return Value
Boolean
 True if the naming category is valid, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
AssemblyInstance Class
Autodesk.Revit.DB Namespace